In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train (1).csv')

In [4]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
# количество погибших в катастрофе
df.query('Survived == 0').shape[0]

549

In [58]:
# количество выживших в катастрофе
df.query('Survived == 1').shape[0]

342

In [61]:
# количество выживших в катастрофе мужчин
df.query('Survived == 1 and Sex == "male"').shape[0]

109

In [62]:
# количество выживших в катастрофе женщин
df.query('Survived == 1 and Sex == "female"').shape[0]

233

In [53]:
# количество погибших несовершеннолетних
df.query('Survived == 0 and Age < 18').shape[0]

52

In [63]:
# количество выживших несовершеннолетних
df.query('Survived == 1 and Age < 18').shape[0]

61

In [64]:
# количество погибших совершеннолетних
df.query('Survived == 0 and Age > 18').shape[0]

355

In [67]:
# количество выживших совершеннолетних
df.query('Survived == 1 and Age > 18').shape[0]

220

In [43]:
# количество выживших, севших в порте C
df.query('Survived == 1 and Embarked == "C"').shape[0]

93

In [44]:
# количество выживших, севших в порте S
df.query('Survived == 1 and Embarked == "S"').shape[0]

217

In [46]:
# количество выживших, севших в порте Q
df.query('Survived == 1 and Embarked == "Q"').shape[0]

30

In [48]:
# количество выживших, имеющих место высшего класса
df.query('Survived == 1 and Pclass == 1').shape[0]

136

In [50]:
# количество выживших, имеющих место среднего класса
df.query('Survived == 1 and Pclass == 2').shape[0]

87

In [55]:
# количество выживших, имеющих место низшего класса
df.query('Survived == 1 and Pclass == 3').shape[0]

119

In [57]:
# количество выживших, имеющих сводных братьев или сестёр
df.query('Survived == 1 and SibSp > 0').shape[0]

132

In [75]:
# Выжившие несовершеннолетние брат и сестра, севшие в порте S
df.query('Survived == 1 and Embarked == "S" and Age < 18 and SibSp == 2')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
183,184,1,2,"Becker, Master. Richard F",male,1.0,2,1,230136,39.0,F4,S
618,619,1,2,"Becker, Miss. Marion Louise",female,4.0,2,1,230136,39.0,F4,S

In [77]:
# средняя стоимость билета
df['Fare'].mean()

32.2042079685746

In [79]:
# средний возраст пассажиров
df['Age'].mean()

29.69911764705882

In [93]:
# количество пассажиров, севших в порте Q
df.query('Embarked == "Q"').shape[0]

77

In [94]:
# количество пассажиров, севших в порте S, имеющих место высшего класса
df.query('Embarked == "S"').shape[0]

644

In [96]:
# количество пассажиров, севших в порте C
df.query('Embarked == "C"').shape[0]

168

In [98]:
# Выжило меньше людей, чем погибло.
# Среди погибших больше мужчин, чем женщин.
# Среди несовершеннолетних больше выживших, нежели погибших, а среди совершеннолетних ситуация обратная.
# Больше всего выжило пассажиров, севших в порте S, но по соотношению выжившие/погибшие, он является самым небезопасным.
# Выжило больше пассажиров, имеющих место высшего класса.
# 139 выживших имели сводных братьев или сестёр.

# Выжившие несовершеннолетние брат и сестра, севшие в порте S:
# Becker, Master. Richard F
# Becker, Miss. Marion Louise

# Средняя стоимость билета = 32.20
# Средний возраст пассажиров = 29.69